from settings import ClanSettings

"""
Базовые сообщения
Чтобы не писать одно и тоже
"""

USER_NOT_FOUND = "❌ Пользователь не зарегистрирован"
NOT_ENOUGH_COINS = "❌ Недостаточно коинов на балансе"
YOU_HAVE_CLAN = "❌ Вы уже состоите в клане"
USER_HAVE_CLAN = "❌ Пользователь уже находится в клане"


CLAN_GREETING = "👑 Добро пожаловать"  # приветствие клана
CLAN_NOT_FOUND = "❌ Клан не найден"
CLAN_IS_CLOSED = "❌ Вход в клан закрыт"

CLAN_TAG_OCCUPIED = "❌ Это тег клана уже занят"
CLAN_NAME_OCCUPIED = "❌ Это имя клана уже занято"

MAX_COUNT_MEMBERS_IN_CLAN = "❌ В клане уже максимальное количество участников"
NOT_OVERCOME_CLAN_BARRIER = "❌ Вы не преодолели порог входа в клан"

CLAN_NAME_LENGTH = "❌ Имя клана должно содержать не более " \
                  f"{ClanSettings.MAX_CLAN_NAME} символов, попробуй еще раз:"
CLAN_TAG_LENGTH = "❌ Тег клана должен содержать не более " \
                 f"{ClanSettings.MAX_CLAN_TAG} символов, попробуй еще раз:"

APPLICATION_SENT = "✅ Заявка отправлена"
APPLICATION_ALREADY_SENT = "❌ Вы уже отправили заявку"
APPLICATION_EXPIRED = "❌ Это заявка уже устарела"

BACK_MAIN_MENU = "✅ Вы вернулись в главное меню!"
BACK_SERVICES_MENU = "Выберите сервис"

DATA_OUTDATED = "Данные устарели"
DATA_OUTDATED_LOWER = DATA_OUTDATED.lower()
LIMIT_ATTEMPTS = "Превышено количество попыток"
INCORRECT_DATA = "Некорректные данные"
COMMAND_NOT_FOUND = "Команда не распознана, воспользуйтесь клавиатурой:"
SOMETHING_WENT_WRONG = "Упс, похоже что-то пошло не так"

THIS_NOT_LINK = "😒 Это не похоже на ссылку"
ENTER_LINK_USER = "Введи @username или ID игрока"
PATTERN_BANNED_SYMBOLS = "❌ Найдены запрещенные символы: {0}"


ACCESS_FOR_CHAT_OWNER = "Для доступа к этой команде необходимо быть создателем беседы"
ACCESS_FOR_CHAT_OWNER_AND_HELPERS = "Для доступа к этой команде необходимо быть создателем беседы или помощником"

REPEAT_CHAT_SUBSCRIPTION = """
    К сожалению, ваша подписка на игровой чат истекла.
    Но не беспокойтесь! Вы всегда можете повторить подписку, просто воспользуйтесь командой "Повторить подписку".
"""

